app/Models/UserModel.php

    public function get_users($limit, $offset)
    {
        return $this->orderBy('id', 'ASC')->findAll($limit, $offset);
---
SELECT *
FROM `users`
ORDER BY `id` ASC
 LIMIT 5

    public function get_total_users()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`